run/MarangoniWithPhaseChange/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleThermoVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000e-5;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   100e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.02;
maxAlphaCo      0.02;

maxDeltaT       1e-5;

libs
(
    "liberrorFunction1.so"
);

DebugSwitches
{
    MULES           1;
}

// ************************************************************************* //

OptimisationSwitches
{
    fileHandler collated;
}

functions
{
    residuals
    {
        type            residuals;

        libs            ("libutilityFunctionObjects.so");

        writeControl    timeStep;
        writeInterval   1;

        fields          (p_rgh);
    }

    divU
    {
        type            div;

        libs            ("libfieldFunctionObjects.so");

        writeControl    writeTime;

        writeFields     true;

        regionType      all;

        result          divU;

        field           phi;
    }

    maxValue
    {
        type            volFieldValue;

        libs            ("libfieldFunctionObjects.so");

        log             true;

        writeControl    writeTime;

        writeFields     false;

        regionType      all;

        cellZone        all;

        operation       maxMag;

        fields (p_rgh U T divU);
    }
}