run/MarangoniWithPhaseChange/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          15;
        startFace       275;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       290;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       300;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          15;
        startFace       310;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          150;
        startFace       325;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          150;
        startFace       475;
    }
)

// ************************************************************************* //
