run/MarangoniWithPhaseChange/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          ( bismuth argon );


sigma
{
  type  temperatureDependent;
  sigma
  {
    type    table;
    values
    (
        (544 0.365)
        (644 0.358)
    );
    outOfBounds         clamp;
    interpolationScheme linear;
  }
}

L           44600;
Cu          100000;
alphaSolidT
{
    type    errorFunction;
    Tliq    545.0;
    Tsol    544.0;
}


// ************************************************************************* //